Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: དེའི་ཚེ་ཚོགས་དེའི་ནང་ན་བྱང་ཆུབ་སེམས་དཔའ་ས་འཛིན་ཞེས་བྱ་བ་ཞིག་བྱུང་སྟེ།
en: Among these followers was a bodhisattva by the name of Dharaṇīdhara.

source: བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་དཔག་ཏུ་མེད་པ་དང་ལྡན་པ་དབང་པོ་རྣོ་བ།
en: Endowed with boundless qualities, this bodhisattva was in possession of sharp faculties.

source: སེམས་རེ་རེ་བསྐྱེད་པས་བསྐལ་པ་གྲངས་མེད་པའི་དགེ་བའི་རྩ་བ་མངོན་པར་འདུ་བྱེད་པ། སེམས་རེ་རེ་བསྐྱེད་པས་སེམས་ཅན་གྲངས་མེད་པ་དག་ཉན་ཐོས་ཀྱི་ཐེག་པ་ལ་རབ་ཏུ་བཙུད། དེ་བཞིན་དུ་རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་དང་།
en: With each state of mind he would create incalculable eons’ worth of roots of virtue and bring innumerable sentient beings into the vehicles of the hearers, the solitary buddhas, and the bodhisattvas.

source: དེ་བཞིན་དུ་སེམས་རེ་རེ་བསྐྱེད་པས་བྱང་ཆུབ་སེམས་དཔའ་ཁྲི་ཕྲག་གྲངས་མེད་པ་དག་ཕྱིར་མི་ལྡོག་པར་རབ་ཏུ་བཙུད་དོ། །
en: Likewise, with each state of mind he would establish innumerably many tens of thousands of bodhisattvas at the irreversible stage.

source: དེའི་ཚེ་སེམས་ཅན་ཁྲི་ཕྲག་དཔག་ཏུ་མེད་པ་དག་ནི་ཉན་ཐོས་ཀྱི་ཐེག་པ་ལ་རབ་ཏུ་གནས་སོ། །
en: “During that time there were unfathomably many tens of thousands of beings within the vehicle of the hearers,

source: སེམས་ཅན་ཁྲི་ཕྲག་དཔག་ཏུ་མེད་པ་དག་ནི་རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ལ་རབ་ཏུ་གནས་སོ། །
en: unfathomably many tens of thousands of beings within the vehicle of the solitary buddhas,

source: སེམས་ཅན་ཁྲི་ཕྲག་དཔག་ཏུ་མེད་པ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་རབ་ཏུ་གནས་སོ། །
en: and unfathomably many tens of thousands of beings within the vehicle of the bodhisattvas.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ས་འཛིན་དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: Considering those beings, the bodhisattva Dharaṇīdhara thought to himself,

source: ཀྱེ་མ་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་རབ་ཏུ་འབེབས་པས་གང་གིས་སེམས་ཅན་གང་དེ་དག་ངེས་པར་འབྱུང་བར་བཅོམ་ལྡན་འདས་ཀྱིས་ལུང་བསྟན་པ་མཛད་པས།
en: ‘Ah, may the thus-gone Rainfall from the Clouds of Dharma grant prophecies about the deliverance of all these beings!

source: རང་རང་གི་འཁོར་འདི་དག་ཉིད་ལུང་བསྟན་པ་ཐོས་ནས་ཡི་རངས་པར་གྱུར་ཅིག་སྙམ་མོ། །
en: And may all these members of his different retinues hear those prophecies and rejoice!’

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་རབ་ཏུ་འབེབས་པས་སེམས་ཅན་དེ་དག་ཇི་ལྟར་སྨོན་པ་བཞིན་དུ་ལུང་བསྟན་ཏོ། །
en: When the bodhisattva Dharaṇīdhara had made this prayer the thus-gone Rainfall from the Clouds of Dharma then indeed granted the prophecies.

source: མཽད་གལ་གྱི་བུ་ཁྱོད་དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་ས་འཛིན་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Maudgalyāyana, in case you may think that at that time the bodhisattva Dharaṇīdhara was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་ས་འཛིན་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was the bodhisattva Dharaṇīdhara.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཡང་དག་པར་རབ་ཏུ་གནས་པའི་སེམས་ཅན་དག་ཡོངས་སུ་གཟུང་བར་བྱའོ། །
en: Thus, Maudgalyāyana, one must provide for sentient beings who remain within the vehicle of the bodhisattvas.”

source: མཽད་གལ་གྱི་བུ་ངས་མོས་པ་སྣ་ཚོགས་ཤེས་པར་བྱ་བའི་དོན་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་དགེ་བའི་རྩ་བ་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created boundless roots of virtue in order to understand the various inclinations.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་དེ་བཞིན་གཤེགས་པ་ཉེ་བར་ཞི་འཕགས་ཞེས་བྱ་བ།
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past, there appeared in the world a thus-gone one named Noble Peace;

source: རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་འཇིག་རྟེན་དུ་བྱུང་ངོ་། །
en: he was learned and venerable, a blissful one, a knower of the world, a steersman who guided beings, unexcelled, a teacher of gods and humans, a buddha, a blessed one.

source: དེ་བཞིན་གཤེགས་པ་ཉེ་བར་ཞི་འཕགས་དེའི་སངས་རྒྱས་ཀྱི་ཞིང་དེར་བྱང་ཆུབ་སེམས་དཔའ་ནོར་བུ་འཛིན་ཞེས་བྱ་བ་དེ་བཞིན་གཤེགས་པ་དཔག་ཏུ་མེད་པ་རྣམས་ལ་ཡུན་རིང་དུ་ཚངས་པར་སྤྱད་པ།
en: Within the buddha realm of the thus-gone Noble Peace there was a bodhisattva named Vasuṁdhara, who had for long been training in pure conduct in the presence of innumerable thus-gone ones.

source: དགེ་བའི་རྩ་བ་དཔག་ཏུ་མེད་པས་གང་བ། སྙིང་རྗེ་ཆེན་པོ་ཐོབ་པ་ཞིག་བྱུང་སྟེ
en: He was filled with unfathomable virtuous roots and possessed great compassion.

source: དེ་དེ་བཞིན་གཤེགས་པ་དེའི་རིམ་གྲོ་པར་གྱུར་ཏོ། །དེ་དེ་བཞིན་གཤེགས་པ་དེ་ལ་ཡིད་དུ་འཐད་དེ།
en: Now he was serving the thus-gone Noble Peace, doing only what was suitable and never anything else.

source: ཡིད་དུ་མི་འཐད་པ་མ་ཡིན་པས་རིམ་གྲོ་པ་བྱས་ཤིང་། བཤད་པ་ཡང་འཛིན་ལ། རང་གི་དོན་ཀྱང་མི་གཏོང་ངོ་། །
en: He kept in mind what had been explained and did not consider his own objectives.

source: དེས་བཅོམ་ལྡན་འདས་ཀྱི་རིམ་གྲོ་པ་བྱས་ཏེ། མངོན་པར་ཤེས་པ་ལྔ་བསྒྲུབས་པས་དེ་ཕ་རོལ་གྱི་སེམས་ལ་མཁས་སོ། །
en: As he in this manner served the Blessed One, he accomplished the five superknowledges and became skilled in knowing the minds of others.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཉེ་བར་ཞི་འཕགས་དེའི་ཐུགས་ཀྱིས་སེམས་མཁྱེན་པ་མཛད་ནས་གང་གི་ཚེ་དེ་བཞིན་གཤེགས་པ་དེ་དབེན་པ་ལ་བཞུགས་པས་བཞུགས་པ་དེའི་ཚེ་དེ་རང་གི་དོན་མི་གཏོང་ངོ་། །
en: The blessed thus-gone Noble Peace knew his state of mind and so, whenever the thus-gone went off into solitude the bodhisattva would follow the Blessed One without considering his own objectives.

source: དེ་བཞིན་གཤེགས་པ་ཉེ་བར་ཞི་འཕགས་དེ་ཡང་དེའི་བསམ་པ་ཐུགས་སུ་ཆུད་ནས། དེ་ལྟ་བུའི་ཚུལ་གྱིས་བཞུགས་པས་བཞུགས་སོ། །
en: And as the thus-gone Noble Peace knew the bodhisattva’s thoughts, he would act likewise.

source: ནོར་བུ་འཛིན་དེའི་འགྲོ་བའི་ཡུལ་ཅི་ཙམ་པ་དེ་ཙམ་དུ་བཞུགས་པས་བཞུགས་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་ནོར་བུ་འཛིན་དེ་ཡང་དེའི་རྗེས་སུ་འབྲང་ངོ་། །
en: Whenever Vasuṁdhara would go somewhere the Thus-Gone One would be present there, and the bodhisattva Vasuṁdhara would in the same way also follow the thus-gone Noble Peace.

source: དེ་ལྟར་དེ་བཞིན་གཤེགས་པ་དེས་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་བཞུགས་པ་ལ་བསླབས་སོ། །
en: Such was the way in which the Thus-Gone One trained the bodhisattva in the activities of the buddhas.

source: དེ་དེ་བཞིན་གཤེགས་པ་དེའི་ཁམས་སྣ་ཚོགས་ཤེས་པ་དེའི་ནང་དུ་ཆུད་དོ། །
en: In this way the bodhisattva was introduced to the Thus-Gone One’s knowledge of diverse elements.

source: མཽད་གལ་གྱི་བུ་ཁྱོད་དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་ནོར་བུ་འཛིན་ཞེས་བྱ་བ་གང་གིས། དེ་བཞིན་གཤེགས་པ་དེའི་ཁམས་སྣ་ཚོགས་ཡང་དག་པར་དྲན་པར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་དེ་ལྟར་མི་བལྟ་སྟེ
en: “Maudgalyāyana, in case you may think that the bodhisattva Vasuṁdhara, who in those days was mindful of the Thus-Gone One’s diverse elements, was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་ནོར་བུ་འཛིན་ཞེས་བྱ་བར་གྱུར་ཏེ། དེ་བཞིན་གཤེགས་པ་དེའི་མོས་པ་སྣ་ཚོགས་ཤེས་པ་རྗེས་སུ་རྟོགས་སོ། །
en: In those days, I was the bodhisattva Vasuṁdhara, who thus realized the Thus-Gone One’s knowledge of the various inclinations.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་དེ་བཞིན་གཤེགས་པ་བཞུགས་པ་རྗེས་སུ་རྟོགས་པར་བྱའོ། །
en: In this way, Maudgalyāyana, bodhisattvas must comprehend the activities of the thus-gone ones.

source: མཽད་གལ་གྱི་བུ་ངས་མོས་པ་སྣ་ཚོགས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་དགེ་བའི་རྩ་བ་རྣམ་པ་སྣ་ཚོགས་དུ་མ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created numerous different roots of virtue in order to understand knowledge of the origin as related to knowledge of the various inclinations.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན། དེ་བཞིན་གཤེགས་པ་སྤྱན་མཛེས་ཞེས་བྱ་བ་ནས།
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past, there appeared in the world a thus-gone one named Sunetra;

source: དེ་བཞིན་གཤེགས་པ་སྤྱན་མཛེས་དེའི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་བྱེ་བ་ཕྲག་དགུ་བཅུ་རྩ་དགུ་བྱུང་སྟེ། སངས་རྒྱས་ཀྱི་ཞིང་དེར་རྣམ་པ་ཐམས་ཅད་དུ་སེམས་ཅན་དམྱལ་བ་མ་བྱུང་། དུད་འགྲོའི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་དང་། ལྷ་མ་ཡིན་གྱི་རིས་དག་མ་བྱུང་སྟེ།
en: The buddha realm of the thus-gone Sunetra encompassed nine hundred ninety million universes and throughout all of them there were no hell beings, no animals, no inhabitants of the realms of the Lord of Death, and no demigods.

source: རྣམ་པ་ཐམས་ཅད་ཀྱི་ཐམས་ཅད་དུ་མི་ཁོམ་པ་མ་བྱུང་ངོ་། །
en: Never was anyone in an unfree state.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེར་གཅིག་ཏུ་ཡོངས་སུ་དག་པར་གྱུར་ཏེ། སངས་རྒྱས་ཀྱི་ཞིང་དེར་ཀུན་ནས་ཉོན་མོངས་པའི་ལས་ཅུང་ཟད་ཀྱང་མེད་དོ། །
en: This buddha realm was entirely and completely pure, because within it no acts of affliction occurred.

source: དེ་ལྟར་དེ་བཞིན་གཤེགས་པ་དེས་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་སེམས་ཅན་དཔག་ཏུ་མེད་པ་དག་ཡོངས་སུ་སྨིན་པར་མཛད་དོ། །
en: That Thus-Gone One had previously brought innumerable beings to maturation while practicing the activities of a bodhisattva.

source: དེའི་ཚེ་སངས་རྒྱས་ཀྱི་ཞིང་དེར་བྱང་ཆུབ་སེམས་དཔའ་ཆུ་ལྷ་ཞེས་བྱ་བ་ཁྱིམ་ན་གནས་པ་ཞིག་བྱུང་སྟེ།
en: “At the time there was within that buddha realm a bodhisattva called Varuṇa, who lived as a householder.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤྱན་མཛེས་དེའི་དགེ་བསྙེན་རིགས་ལ་ཐུགས་བརྟན་པ་ཡིན་ཏེ། འདི་ལྟ་སྟེ་དཔེར་ན། བཅོམ་ལྡན་འདས་འོད་སྲུང་གི་བུ་རིགས་རྫ་མཁན་དང་། ངའི་སྦྲང་ཚལ་བཀྲ་བ་ལྟ་བུའོ། །
en: The lay followers of the blessed thus-gone Sunetra were of the steadfast kind, just as Ghaṭīkāra during the time of the Blessed One Kāśyapa, or the layperson Beautiful Honey Grove among my own.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཆུ་ལྷ་དེས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤྱན་མཛེས་དེའི་དྲུང་དུ་སོང་ནས་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ཕྱོགས་གཅིག་ཏུ་འདུག་གོ། །ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་
en: “The bodhisattva Varuṇa went before the blessed thus-gone Sunetra, bowed his head to his feet, and stood to one side.

source: བྱང་ཆུབ་སེམས་དཔའ་ཆུ་ལྷ་དེས་སྐྱེ་བོའི་ཚོགས་མང་པོ་དེ་དག་གི་མདུན་དུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤྱན་མཛེས་དེ་ལ་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་ཞུ་བ་ཞུས་པ།
en: Then, before the great gathering of beings assembled there, he offered the following verses to the thus-gone Sunetra:

source: སྟོབས་བཅུ་སྒྲ་གྲགས་ལྷ་མིའི་འཇིག་རྟེན་དག་ན་འདྲ་མ་མཆིས། །
en: “ ‘Renowned for your ten powers, you have no equal among gods or humans.

source: རྒྱལ་བ་འགྲོ་བའི་བསམ་པ་མཁྱེན་ཅིང་ལྷག་པར་མོས་པ་རབ་ཏུ་མཁྱེན། །
en: Conqueror, you know the thoughts and inclinations of beings.

source: རྒྱལ་བ་འདྲེན་པ་མོས་པ་སྣ་ཚོགས་དང་ནི་དེ་འགོག་རབ་ཏུ་མཁྱེན། །ཇི་ལྟར་ལྷག་པར་མོས་པ་སྣ་ཚོགས་འགོག་པར་འགྱུར་བ་དེ་དག་གསུངས། །
en: Victorious Guide, you know their various inclinations, as well as their cessation, And so you show how the various inclinations come to an end.

source: ཇི་ལྟར་རྣམ་འདྲེན་ཁྱོད་སྲས་སེམས་ཅན་ཀུན་གྱི་མོས་པ་སྣ་ཚོགས་དག །ཡང་དག་འགོག་འགྱུར་མངོན་པར་འཚལ་བ་དེ་དག་བདེ་གཤེགས་བདག་ལ་གསུངས། །
en: “ ‘Blissful Guide, please explain to me how your children Pursue the cessation of the various inclinations of all beings.’

source: རྒྱལ་བ་ཐམས་ཅད་གཟིགས་པ་ལྷ་དང་མི་ཡི་བསམ་པ་ཀུན་ལ་མཁས། །འཇིག་རྟེན་ཐམས་ཅད་ལ་ནི་ཕན་ཕྱིར་སྤྱན་མཛེས་དེས་ནི་ལུང་བསྟན་པ། །
en: The omniscient victor Sunetra, expert about all the wishes of gods and humans, Then gave this teaching for the benefit of the entire world:

source: གང་ཚེ་འགོག་པར་འགྱུར་བ་ཡོངས་སུ་མཁྱེན་ནས་འགྲོ་བའི་དོན་ཆེན་མཛད། །
en: “ ‘Knowing cessation, the thus-gone ones act for the great benefit of beings.

source: དེ་བཞིན་གཤེགས་པས་འགྲོ་བའི་མོས་པ་སྣ་ཚོགས་ལུས་པ་མེད་པར་མཁྱེན། །
en: They know the various inclinations of beings without any exception.

source: ཇི་ལྟར་གཞོལ་བའི་རིས་ནི་འབབ་པའི་ཆུ་དག་འབབ་པར་འགྱུར་བ་ལྟར། །ཡུལ་ནི་གང་དང་གང་ལ་མི་ཡིས་ཕྱིར་བསྟེན་དེ་ལ་དེ་མོས་སོ། །
en: Like cascading water, people continuously wish For all those things on which they depend.

source: དེ་ནི་བདེ་གཤེགས་བསྟན་པ་ཐོབ་ཅིང་དགེ་བའི་བཤེས་གཉེན་སངས་རྒྱས་ལ། །རིམ་པར་སྟེན་བྱེད་ཡུལ་ལ་མངོན་པར་ཆགས་པ་དོན་མེད་ཡོངས་སུ་ཤེས། །
en: “ ‘As they obtain the teaching of the thus-gone ones and follow buddhas as their teachers, They will realize that attachment to objects is meaningless.

source: དེ་ནི་འཆིང་བ་ཤེས་ཤིང་ཡུལ་གྱི་སྐྱོན་ཡང་ཤེས་ནས་ཡོངས་སུ་སྤོང་། །
en: Knowing that as bondage, they understand the flaws of objects and give them up.

source: ཡུལ་གྱི་སྐྱོན་དག་ཡོངས་སུ་མཐོང་བ་འགག་པར་བྱེད་ཅིང་ཕྱིར་མི་སྐྱེ། །
en: Perceiving the flaws of objects, they overcome them so that they do not recur.

source: གང་དག་ཡུལ་འདི་མཐོང་ནས་ཡང་དང་ཡང་དུ་གོམས་པ་འགོག་མི་བྱེད། །
en: “ ‘Those who see objects and repeatedly focus on them do not see their flaws.

source: དེ་དག་ཡུལ་གྱི་རོ་མཆོག་དག་གིས་ཟིལ་ནོན་སྡུག་བསྔལ་སྐྱེད་པར་བྱེད། །
en: Overcome by the great taste of these objects, they create further suffering.

source: དེ་ལྟ་བས་ན་མཁས་པའི་མི་དག་འགྲོ་ལ་ཕན་བསམས་བྱང་ཆུབ་མཆོག །མངོན་པར་འདོད་པ་དེས་ནི་བསྒྲིམས་ཏེ་ཡུལ་དག་ཡོངས་སུ་ཤེས་པར་བྱ། །
en: Therefore, wise people who wish for supreme awakening to benefit others Must diligently apply themselves to understanding objects.’

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་ཆུ་ལྷ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་དེ་ལྟར་མི་བལྟ་སྟེ
en: “Maudgalyāyana, in case you may think that at that time the bodhisattva Varuṇa was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་ཆུ་ལྷ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was the bodhisattva Varuṇa.

source: ངས་དེར་ཡུལ་དེ་དག་ཡོངས་སུ་ཤེས་པས་དེ་ཕྱིན་ཆད་ང་ནམས་ཀྱང་སྐྱོན་མ་བྱུང་ངོ་། །
en: Once I had fully understood objects, I was no longer harmed by them.

source: དེ་ལྟར་ངས་དེ་དག་དོན་མེད་པར་ཡོངས་སུ་ཤེས་སོ། །
en: Because I had understood that they are insubstantial.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་ཡུལ་དོན་མེད་པར་གྱུར་པ་ཡོངས་སུ་ཤེས་པར་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattvas must comprehend that objects are insubstantial.

source: མཽད་གལ་གྱི་བུ་ངས་མོས་པ་སྣ་ཚོགས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་དགེ་བའི་རྩ་བ་དཔག་ཏུ་མེད་པ་དག་བསྐྱེད་དོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created boundless roots of virtue in order to understand cessation as related to knowledge of the various inclinations.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་དེ་བཞིན་གཤེགས་པ་སེམས་ཅན་ཐམས་ཅད་བྱང་ཆུབ་ཏུ་སྒྲོལ་བ་ལ་མཁས་པ་ཞེས་བྱ་བ་ནས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་བར་འཇིག་རྟེན་དུ་བྱུང་ངོ་། །
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past, there appeared in the world a thus-gone one named Skilled in Releasing into Awakening; he was learned and venerable, a blissful one, a knower of the world, a steersman who guided beings, unexcelled, a teacher of gods and humans, a buddha, a blessed one.

source: དེ་བཞིན་གཤེགས་པ་དེས་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན། སེམས་ཅན་གང་ཡང་ཉན་ཐོས་ཀྱི་ཐེག་པའམ། རང་སངས་རྒྱས་ཀྱི་ཐེག་པས་ཡོངས་སུ་སྨིན་པར་མ་བྱས་ཀྱི།
en: When previously that thus-gone one had pursued the activities of a bodhisattva he did not ripen any beings by means of the vehicles of the hearers or solitary buddhas.

source: སེམས་ཅན་ཐམས་ཅད་བྱང་ཆུབ་ཀྱི་སེམས་ཡང་དག་པར་འཛིན་དུ་བཙུད་དོ། །
en: Instead, he made all sentient beings embrace the mind of awakening.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེའི་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སེམས་ཅན་དེ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་རབ་ཏུ་གནས་པར་གྱུར་ཏོ། །
en: This unsurpassed and perfect buddha established the beings of his buddha realm within unsurpassed and perfect awakening

source: སེམས་ཅན་དེ་དག་ལ་དེ་བཞིན་གཤེགས་པ་དེས་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལས་བརྩམས་ཏེ་ཆོས་སྟོན་ཏོ། །
en: and this Thus-Gone One taught them the Dharma based on the six perfections.

source: དེ་བཞིན་གཤེགས་པ་སེམས་ཅན་ཐམས་ཅད་བྱང་ཆུབ་ཏུ་སྒྲོལ་བ་ལ་མཁས་པ་དེས་སེམས་ཅན་དཔག་ཏུ་མེད་པ་དག་ཕྱིར་མི་ལྡོག་པ་ཉིད་ལ་བཙུད་ཅིང་།
en: The Thus-Gone Skilled in Releasing into Awakening brought an infinite number of beings to the irreversible stage,

source: བསྐལ་པ་གྲངས་མེད་པར་གནས་ནས་ཕྱིས་ཕུང་པོ་ལྷག་མ་མེད་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་སོ། །
en: and having remained for innumerable eons he then passed beyond suffering within the field of nirvāṇa free from any remainder of the aggregates.

source: སེམས་ཅན་གང་བྱུང་བ་དེ་དག་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། སེམས་ཅན་དཔག་ཏུ་མེད་པའི་དོན་བྱས་ཏེ། ཡོངས་སུ་མྱ་ངན་ལས་འདས་སོ། །
en: Causing everyone to awaken to unsurpassed and perfect buddhahood, he benefitted innumerable sentient beings before passing into total nirvāṇa.

source: དེའི་ཚེ་སངས་རྒྱས་ཀྱི་ཞིང་དེར་བྱང་ཆུབ་སེམས་དཔའ་ལྷའི་ཟླ་བ་ཞེས་བྱ་བ་ཞིག་བྱུང་ངོ་། །
en: “Within that buddha realm there then appeared a bodhisattva by the name of Divine Moon.

source: བྱང་ཆུབ་སེམས་དཔའ་ལྷའི་ཟླ་བ་དེས་སངས་རྒྱས་ཀྱི་ཞིང་བཅུའི་རྡུལ་ཕྲ་མོ་སྙེད་ཀྱི་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་སུ་བྱང་ཆུབ་སེམས་དཔའ་ཁྲི་ཕྲག་དཔག་ཏུ་མེད་པ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་བཙུད་ནས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་སོ། །
en: Before passing beyond suffering this bodhisattva, Divine Moon, would throughout the universes in the ten directions establish many other bodhisattvas, numerous as the particles comprising ten buddha realms, within unsurpassed and perfect buddhahood.

source: དེའི་ཚེ་སངས་རྒྱས་ཀྱི་ཞིང་དེར་བྱང་ཆུབ་སེམས་དཔའ་དྲི་མེད་ཟླ་བ་ཞེས་བྱ་བ་ཞིག་བྱུང་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་ལྷའི་ཟླ་བ་དེས་ཡོངས་སུ་སྨིན་པར་བྱས། ཡོངས་སུ་རྫོགས་པར་བྱས་སོ། །
en: “In the same buddha realm there was at the time a bodhisattva by the name of Vimalacandra, who had himself been ripened and fulfilled by the bodhisattva Divine Moon.

source: དེ་འདི་སྙམ་དུ་སེམས་སོ། །
en: This Vimalacandra thought to himself,

source: གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་ལྷའི་ཟླ་བ་དེས་སེམས་ཅན་ཁྲི་ཕྲག་དཔག་ཏུ་མེད་པ་དག་བྱང་ཆུབ་ལ་བཙུད། སངས་རྒྱས་ཀྱི་རྒྱུད་ཡང་དག་པར་སྤེལ་ཏོ། །
en: ‘The bodhisattva Divine Moon brought innumerably many thousands of sentient beings to awakening, and he truly expanded the continuum of buddhahood.

source: བདག་གིས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་དེའི་རྗེས་སུ་བསླབ་པར་བྱ།
en: I shall follow in his footsteps.

source: བདག་གིས་ཀྱང་སངས་རྒྱས་ཀྱི་རྒྱུད་ཡང་དག་པར་སྤེལ་བར་བྱའོ་སྙམ་མོ། །
en: I, too, shall expand the continuum of buddhahood.’

source: དེས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་དེ་ན་སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་ཤེས་ནས། སེམས་ཅན་རྣམས་ཀྱི་མོས་པ་ཇི་ལྟ་བ་བཞིན་དུ་སྤྲུལ་པ་མངོན་པར་སྤྲུལ་ཏོ། །
en: “Then, as he was aware of the thoughts of all beings throughout the buddha realm, he sent forth emanations in accord with everyone’s inclinations.

source: ལྷ་དག་ལ་མོས་པ་ནི་ལྷའི་སྤྲུལ་པ་མངོན་པར་སྤྲུལ། ཀླུ་དག་ལ་མོས་པ་དང་། གནོད་སྦྱིན་དག་ལ་མོས་པ་དང་། དྲི་ཟ་དག་ལ་མོས་པ་དང་། ལྷ་མ་ཡིན་དག་ལ་མོས་པ་དང་། མིའམ་ཅི་དག་ལ་མོས་པ་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དག་ལ་མོས་པ་ནི་ལྟོ་འཕྱེ་ཆེན་པོའི་སྤྲུལ་པ་མངོན་པར་སྤྲུལ་ཏོ། །
en: As per the inclinations of the gods, he produced emanated gods, while for the nāgas, yakṣas, gandharvas, demigods, kiṃnaras, and mahoragas he likewise sent forth corresponding emanations in accord with their inclinations.

source: དེ་ལྟར་གང་དང་གང་ལ་མོས་པ་དེ་དང་དེ་དག་གི་རྗེས་སུ་འཐུན་པའི་སྤྲུལ་པ་མངོན་པར་སྤྲུལ་ཏེ། སངས་རྒྱས་ཀྱི་ཞིང་དེར་སེམས་ཅན་ཇི་སྙེད་པ་དེ་དག་ཡུན་མི་རིང་བར་ལ་ལ་ནི་ཉན་ཐོས་ཀྱི་ཐེག་པ། ལ་ལ་ནི་རང་སངས་རྒྱས་ཀྱི་ཐེག་པར་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྨིན་པར་བྱས་སོ། །
en: Thus, as all the beings of that buddha realm encountered emanations that were in harmony with their inclinations, before long they were matured for awakening within the vehicles of the hearers or the solitary buddhas.

source: དེ་ལྟར་སེམས་ཅན་དེ་དག་ཐམས་ཅད་སངས་རྒྱས་ཀྱི་ཞིང་དུ་དགེ་བའི་རྩ་བ་རྣམས་ལ་རབ་ཏུ་བཙུད་དོ། །
en: In this way all the beings of that buddha realm were guided to roots of virtue.

source: དེར་ཡང་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་དད་པ་བསྐྱེད་དེ། དགེ་བའི་རྩ་བ་དེས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་མོས་པ་སྣ་ཚོགས་ཤེས་པ་ཐོབ་བོ། །
en: Moreover, as the bodhisattvas engendered faith, their roots of virtue made them attain knowledge of the various inclinations of sentient beings.

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་དྲི་མེད་ཟླ་བ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ
en: “Maudgalyāyana, in case you may think that at that time the bodhisattva Vimalacandra was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་དྲི་མེད་ཟླ་བ་ཞེས་བྱ་བར་གྱུར་ཏེ།
en: In those days I was the bodhisattva Vimalacandra.

source: ངས་སེམས་ཅན་དེ་སྙེད་ཅིག་ཐེག་པ་གསུམ་གྱིས་བཏུལ་ཏོ། །
en: It was I who tamed that many beings by means of the three vehicles.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་ལ་བརྩོན་པར་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattvas must endeavor to ripen sentient beings.

source: མཽད་གལ་གྱི་བུ་ངས་མོས་པ་སྣ་ཚོགས་ཤེས་པ་འགོག་པ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་དགེ་བའི་རྩ་བ་རྣམ་པ་སྣ་ཚོགས་དུ་མ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: “Maugalyāyana, when I was training in the practices of a bodhisattva in the past, I created numerous different roots of virtue in order to understand cessation as related to knowledge of the various inclinations.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་རྒྱལ་པོ་ལྷའི་ཟླ་བ་ཞེས་བྱ་བ་འབའ་ཞིག་ཁོ་ནས་འཛམ་བུའི་གླིང་གི་དབང་ཕྱུག་གིས་དབང་བྱེད་པ།
en: “Maudgalyāyana, in the distant past, beyond unfathomable timespans of cyclic existence, there was a king known as Divine Moon, who ruled over Jambūdvīpa.

source: ཆོས་ཀྱི་བདག་པོ་ཆོས་དང་ལྡན་པ། ཆོས་ཀྱིས་མི་འཐུན་པ་མེད་པར་རྒྱལ་སྲིད་བྱེད་པ་ཞིག་བྱུང་ངོ་། །
en: A religious and righteous master, he ruled his realm exclusively in accord with the Dharma.

source: བུ་ཡང་སྟོང་ཐམ་པ་ཡོད་དེ། དཔའ་ཞིང་རྟུལ་ཕོད་པ། ཡན་ལག་མཆོག་གི་གཟུགས་དང་ལྡན་པ། ཕ་རོལ་གྱི་སྡེ་རབ་ཏུ་འཇོམས་པ་དག་བྱུང་ངོ་། །
en: He also had one thousand sons, all of whom were brave, heroic, and athletic, and who conquered all opposing forces.

source: དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་སྒྲོན་མ་ཞེས་བྱ་བ་ཞིག་བྱུང་ངོ་། །
en: “At that time there was a thus-gone known as Lokapradyota.

source: དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་སྒྲོན་མ་ཞེས་བྱ་བ་དེ་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ཡང་དག་པར་རབ་ཏུ་སྟོན་ཏེ། ཉན་ཐོས་ཀྱི་ཐེག་པ་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ལས་བརྩམས་ཏེ་མི་སྟོན་ཏོ། །
en: This Thus-Gone One taught the Bodhisattva Vehicle only, and he did not teach either the vehicle of the hearers or that of the solitary buddhas.

source: དེ་ལྟར་དེ་བཞིན་གཤེགས་པ་དེས་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན། སེམས་ཅན་ཐམས་ཅད་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཡང་དག་པར་འཛིན་དུ་བཙུད་དེ།
en: Because before, when that thus-gone was training in the practices of a bodhisattva, he would guide all beings toward upholding the Bodhisattva Vehicle,

source: སེམས་ཅན་དེ་དག་ཐམས་ཅད་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཡང་དག་པར་རབ་ཏུ་གནས་སོ། །
en: and thus all beings came to abide within that vehicle.

source: དེ་བཞིན་གཤེགས་པ་དེས་དེ་དག་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ཉིད་བསྟན་ཏེ།
en: Hence, that Thus-Gone One taught the Bodhisattva Vehicle to sentient beings,

source: སེམས་ཅན་དེ་དག་ཐམས་ཅད་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ངེས་པར་བྱུང་ངོ་། །
en: and those who received his teaching would attain deliverance within that vehicle.

source: དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་དེའི་སངས་རྒྱས་ཀྱི་ཞིང་དེར་བྱང་ཆུབ་སེམས་དཔའ་དཔའ་བའི་སྟོབས་ཞེས་བྱ་བ་ཚོགས་དེ་ཐམས་ཅད་ཀྱི་གཙོ་བོ་བྱེད་པ་ཞིག་བྱུང་ངོ་། །
en: The head of the gathering of bodhisattvas within the thus-gone Lokapradyota’s buddha realm was a bodhisattva by the name of Bold Strength.

source: དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་དེའི་བདུད་ཤུགས་འཆང་ཞེས་བྱ་བ་གང་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་དེ་དག་གི་བར་ཆད་བྱེད་པར་ཉེ་བར་གནས་པ་ཞིག་བྱུང་ངོ་། །
en: “At that time the māra was called Vegadharin and he was determined to create obstacles for the gathering of bodhisattvas.

source: དེ་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ཡང་དག་པར་ལྡན་པའི་གཏམ་ཟེར་རོ། །དེ་ནས་བདུད་ཤུགས་འཆང་དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: Thinking about the bodhisattvas’ attainment of omniscience, the māra Vegadharin thought to himself,

source: འདི་ལྟར་དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་སྒྲོན་མ་འདིས་ཡུན་མི་རིང་བར་བདག་གི་ཡུལ་སྟོངས་པར་འགྱུར་ཏེ།
en: ‘Before long the thus-gone Lokapradyota will have emptied my entire realm.
